; domain
(define (domain logistics-strips)
  (:requirements :strips) 
  (:predicates 	(OBJ ?obj)
	       	(TRUCK ?truck)
               	(LOCATION ?loc)
		(AIRPLANE ?airplane)
                (CITY ?city)
                (AIRPORT ?airport)
		(at ?obj ?loc)
		(in ?obj1 ?obj2)
		(in-city ?obj ?city))
 
  ; (:types )		; default object

(:action LOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
   (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action LOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
   (at ?obj ?loc) (at ?airplane ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?airplane)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
        (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action UNLOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
        (in ?obj ?airplane) (at ?airplane ?loc))
  :effect
   (and (not (in ?obj ?airplane)) (at ?obj ?loc)))

(:action DRIVE-TRUCK
  :parameters
   (?truck
    ?loc-from
    ?loc-to
    ?city)
  :precondition
   (and (TRUCK ?truck) (LOCATION ?loc-from) (LOCATION ?loc-to) (CITY ?city)
   (at ?truck ?loc-from)
   (in-city ?loc-from ?city)
   (in-city ?loc-to ?city))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action FLY-AIRPLANE
  :parameters
   (?airplane
    ?loc-from
    ?loc-to)
  :precondition
   (and (AIRPLANE ?airplane) (AIRPORT ?loc-from) (AIRPORT ?loc-to)
	(at ?airplane ?loc-from))
  :effect
   (and (not (at ?airplane ?loc-from)) (at ?airplane ?loc-to)))
)

; problem
(define (problem logistics-c3-s2-p10-a2)
(:domain logistics-strips)
(:objects a0 a1 
          c0 c1 c2 
          t0 t1 t2 
          l0-0 l0-1 l1-0 l1-1 l2-0 l2-1 
          p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 
)
(:init
    (AIRPLANE a0)
    (AIRPLANE a1)
    (CITY c0)
    (CITY c1)
    (CITY c2)
    (TRUCK t0)
    (TRUCK t1)
    (TRUCK t2)
    (LOCATION l0-0)
    (in-city  l0-0 c0)
    (LOCATION l0-1)
    (in-city  l0-1 c0)
    (LOCATION l1-0)
    (in-city  l1-0 c1)
    (LOCATION l1-1)
    (in-city  l1-1 c1)
    (LOCATION l2-0)
    (in-city  l2-0 c2)
    (LOCATION l2-1)
    (in-city  l2-1 c2)
    (AIRPORT l0-0)
    (AIRPORT l1-0)
    (AIRPORT l2-0)
    (OBJ p0)
    (OBJ p1)
    (OBJ p2)
    (OBJ p3)
    (OBJ p4)
    (OBJ p5)
    (OBJ p6)
    (OBJ p7)
    (OBJ p8)
    (OBJ p9)
    (at t0 l0-0)
    (at t1 l1-0)
    (at t2 l2-0)
    (at p0 l2-1)
    (at p1 l2-0)
    (at p2 l0-1)
    (at p3 l1-0)
    (at p4 l0-1)
    (at p5 l0-0)
    (at p6 l0-0)
    (at p7 l0-1)
    (at p8 l2-0)
    (at p9 l2-1)
    (at a0 l1-0)
    (at a1 l0-0)
)
(:goal
    (and
        (at p0 l2-1)
        (at p1 l2-0)
        (at p2 l2-0)
        (at p3 l0-1)
        (at p4 l1-0)
        (at p5 l1-0)
        (at p6 l2-0)
        (at p7 l0-1)
        (at p8 l1-1)
        (at p9 l2-1)
    )
)
)

; plan
1. (load-airplane p6 a1 l0-0)
   deleted: (at p6 l0-0)
   added: (in p6 a1)
   goals met: 4 of 10
2. (load-airplane p5 a1 l0-0)
   deleted: (at p5 l0-0)
   added: (in p5 a1)
   goals met: 4 of 10
3. (load-airplane p3 a0 l1-0)
   deleted: (at p3 l1-0)
   added: (in p3 a0)
   goals met: 4 of 10
4. (fly-airplane a0 l1-0 l0-0)
   deleted: (at a0 l1-0)
   added: (at a0 l0-0)
   goals met: 4 of 10
5. (unload-airplane p3 a0 l0-0)
   deleted: (in p3 a0)
   added: (at p3 l0-0)
   goals met: 4 of 10
6. (load-truck p3 t0 l0-0)
   deleted: (at p3 l0-0)
   added: (in p3 t0)
   goals met: 4 of 10
7. (drive-truck t0 l0-0 l0-1 c0)
   deleted: (at t0 l0-0)
   added: (at t0 l0-1)
   goals met: 4 of 10
8. (load-truck p4 t0 l0-1)
   deleted: (at p4 l0-1)
   added: (in p4 t0)
   goals met: 4 of 10
9. (unload-truck p3 t0 l0-1)
   deleted: (in p3 t0)
   added: (at p3 l0-1)
   goals met: 5 of 10
10. (load-truck p2 t0 l0-1)
   deleted: (at p2 l0-1)
   added: (in p2 t0)
   goals met: 5 of 10
11. (drive-truck t0 l0-1 l0-0 c0)
   deleted: (at t0 l0-1)
   added: (at t0 l0-0)
   goals met: 5 of 10
12. (unload-truck p4 t0 l0-0)
   deleted: (in p4 t0)
   added: (at p4 l0-0)
   goals met: 5 of 10
13. (unload-truck p2 t0 l0-0)
   deleted: (in p2 t0)
   added: (at p2 l0-0)
   goals met: 5 of 10
14. (load-airplane p4 a1 l0-0)
   deleted: (at p4 l0-0)
   added: (in p4 a1)
   goals met: 5 of 10
15. (load-airplane p2 a1 l0-0)
   deleted: (at p2 l0-0)
   added: (in p2 a1)
   goals met: 5 of 10
16. (fly-airplane a1 l0-0 l2-0)
   deleted: (at a1 l0-0)
   added: (at a1 l2-0)
   goals met: 5 of 10
17. (load-airplane p8 a1 l2-0)
   deleted: (at p8 l2-0)
   added: (in p8 a1)
   goals met: 5 of 10
18. (unload-airplane p6 a1 l2-0)
   deleted: (in p6 a1)
   added: (at p6 l2-0)
   goals met: 6 of 10
19. (unload-airplane p2 a1 l2-0)
   deleted: (in p2 a1)
   added: (at p2 l2-0)
   goals met: 7 of 10
20. (fly-airplane a1 l2-0 l1-0)
   deleted: (at a1 l2-0)
   added: (at a1 l1-0)
   goals met: 7 of 10
21. (unload-airplane p8 a1 l1-0)
   deleted: (in p8 a1)
   added: (at p8 l1-0)
   goals met: 7 of 10
22. (load-truck p8 t1 l1-0)
   deleted: (at p8 l1-0)
   added: (in p8 t1)
   goals met: 7 of 10
23. (drive-truck t1 l1-0 l1-1 c1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-1)
   goals met: 7 of 10
24. (unload-truck p8 t1 l1-1)
   deleted: (in p8 t1)
   added: (at p8 l1-1)
   goals met: 8 of 10
25. (unload-airplane p5 a1 l1-0)
   deleted: (in p5 a1)
   added: (at p5 l1-0)
   goals met: 9 of 10
26. (unload-airplane p4 a1 l1-0)
   deleted: (in p4 a1)
   added: (at p4 l1-0)
   goals met: 10 of 10
